#include "pgpmac.h"
/*! \file lspmac.c
 *  \brief Routines concerned with communication with PMAC.
 *  \date 2012 – 2013
 *  \author Keith Brister
 *  \copyright All Rights Reserved

  This is a state machine (surprise!)

  Lacking is support for writingbuffer, control writing and reading,
  as well as double buffered memory It looks like several different
  methods of managing PMAC communications are possible.  Here is set
  up a queue of outgoing commands and deal completely with the result
  before sending the next.  A full handshake of acknowledgements and
  "readready" is expected.

  Most of these states are to deal with the "serial-port" style of
  communications.  Things are surprisingly simple for the double
  buffer ascii and control character methods.


<pre>

 State    Description
  -1      Reset the connection
   0      Detached: need to connect to tcp port
   1	  Idle (waiting for a command to send to the pmac)
   2	  Send command
   3	  Waiting for command acknowledgement (no further response expected)
   4	  Waiting for control character acknowledgement (further response expected)
   5	  Waiting for command acknowledgement (further response expected)
   6	  Waiting for get memory response
   7	  Send controlresponse
   8	  Send readready
   9	  Waiting for acknowledgement of "readready"
  10	  Send readbuffer
  11	  Waiting for control response
  12	  Waiting for readbuffer response

</pre>
*/


#define LS_PMAC_STATE_RESET	-1

//! Minimum time between commands to the pmac
//
//#define PMAC_MIN_CMD_TIME 40000.0
#define PMAC_MIN_CMD_TIME 10000.0
static struct timeval pmac_time_sent, now;	//!< used to ensure we do not send commands to the pmac too often.  Only needed for non-DB commands.

//! Size of the PMAC command queue.
#define PMAC_CMD_QUEUE_LENGTH 2048
static pmac_cmd_t rr_cmd, gb_cmd, cr_cmd;		//!< commands to send out "readready", "getbuffer", "controlresponse" (initialized in main)
static pmac_cmd_queue_t ethCmdQueue[PMAC_CMD_QUEUE_LENGTH];	//!< PMAC command queue
static unsigned int ethCmdOn    = 0;				//!< points to next empty PMAC command queue position
static unsigned int ethCmdOff   = 0;				//!< points to current command (or none if == ethCmdOn)
static unsigned int ethCmdReply = 0;				//!< Used like ethCmdOff only to deal with the pmac reply to a command

//! Decode the errors perhaps returned by the PMAC
static char *pmac_error_strs[] = {
  "ERR000: Unknown error",
  "ERR001: Command not allowed during program execution",
  "ERR002: Password error",
  "ERR003: Data error or unrecognized command",
  "ERR004: Illegal character",
  "ERR005: Command not allowed unless buffer is open",
  "ERR006: No room in buffer for command",
  "ERR007: Buffer already in use",
  "ERR008: MACRO auziliary communication error",
  "ERR009: Program structure error (e.g. ENDIF without IF)",
  "ERR010: Both overtravel limits set for a motor in the C.S.",
  "ERR011: Previous move not completed",
  "ERR012: A motor in the coordinate system is open-loop",
  "ERR013: A motor in the coordinate system is not activated",
  "ERR014: No motors in the coordinate system",
  "ERR015: Not pointer to valid program buffer",
  "ERR016: Running improperly structure program (e.g. missing ENDWHILE)",
  "ERR017: Trying to resume after H or Q with motors out of stopped position",
  "ERR018: Attempt to perform phase reference during move, move during phase reference, or enabling with phase clock error",
  "ERR019: Illegal position-chage command while moves stored in CCBUFFER",
  "ERR020: FSAVE issued on Turbo PMAC with incompatible flash memory",
  "ERR021: FSAVE issued while clearing old flash memory sector",
  "ERR022: FREAD attempted but the flash memory is bad"
};


//! The block of memory retrieved in a status request.

//
// DPRAM is from $60000 to $60FFF or $603FFF
//
// We can quickly read 1400 bytes = 350 32-bit registers
// so reading $60000 to 60015D is not too expensive
//
//  $060000  Control Panel Functions
//  $06001A  Motor Data Reporting Buffer
//  $06019D  Background Data Reporting Buffer
//  $0603A7  DPRAM ASCII Command Buffer
//  $0603D0  DPRAM ASCII Response Buffer
//  $060411  Background Variable Read Buffer Control
//  $060413  Binary Rotary Buffer Control
//  $06044F  DPRAM Data Gathering Buffer Control
//  $060450  Variable-Sized Buffers and Open-Use Space
//  $060FFF  End of Small (8k X 16) DPRAM
//  $063FFF  End of Large (32k X 16) DPRAM
//
//
// Gather data starts at $600450 (per turbo pmac user manual)
//



typedef  struct md2StatusStruct {
  //
  // Pmac stores data in 24 bit or 48 bit words
  //
  // The DP: addresses point to the low 16 bits of the 24 bit X and Y registers
  //
  //  PMAC       Our dp ram offset
  //
  // Y:$060000      0x0000
  // X:$060000      0x0002
  // Y:$060001      0x0004
  // X:$060001      0x0006
  // And so forth
  //
  //
  int dummy1;			// 0x000		$60100 
  int omega_status_1;		// 0x004		$60101 
  int alignx_status_1;		// 0x008		$60102
  int aligny_status_1;		// 0x00C		$60103
  int alignz_status_1;		// 0x010		$60104
  int analyzer_status_1;	// 0x014		$60105
  int zoom_status_1;		// 0x018		$60106
  int aperturey_status_1;	// 0x01C		$60107
  int aperturez_status_1;	// 0x020		$60108
  int capy_status_1;		// 0x024		$60109
  int capz_status_1;		// 0x028		$6010A
  int scint_status_1;		// 0x02C		$6010B
  int centerx_status_1;		// 0x030		$6010C
  int centery_status_1;		// 0x034		$6010D
  int kappa_status_1;		// 0x038		$6010E
  int phi_status_1;		// 0x03C		$6010F

  int dummy2;			// 0x040		$60110
  int omega_status_2;		// 0x044		$60111
  int alignx_status_2;		// 0x048		$60112
  int aligny_status_2;		// 0x04C		$60113
  int alignz_status_2;		// 0x050		$60114
  int analyzer_status_2;	// 0x054		$60115
  int zoom_status_2;		// 0x058		$60116
  int aperturey_status_2;	// 0x05C		$60117
  int aperturez_status_2;	// 0x060		$60118
  int capy_status_2;		// 0x064		$60119
  int capz_status_2;		// 0x068		$6011A
  int scint_status_2;		// 0x06C		$6011B
  int centerx_status_2;		// 0x070		$6011C
  int centery_status_2;		// 0x074		$6011D
  int kappa_status_2;		// 0x078		$6011E
  int phi_status_2;		// 0x07C		$6011F

  int dummy3;			// 0x080		$60120
  int omega_act_pos;		// 0x084		$60121
  int alignx_act_pos;		// 0x088		$60122
  int aligny_act_pos;		// 0x08C		$60123
  int alignz_act_pos;		// 0x090		$60124
  int analyzer_act_pos;		// 0x094		$60125
  int zoom_act_pos;		// 0x098		$60126
  int aperturey_act_pos;	// 0x09C		$60127
  int aperturez_act_pos;	// 0x0A0		$60128
  int capy_act_pos;		// 0x0A4		$60129
  int capz_act_pos;		// 0x0A8		$6012A
  int scint_act_pos;		// 0x0AC		$6012B
  int centerx_act_pos;		// 0x0B0		$6012C
  int centery_act_pos;		// 0x0B4		$6012D
  int kappa_act_pos;		// 0x0B8		$6012E
  int phi_act_pos;		// 0x0BC		$6012F


  int acc11c_1;			// 0x0C0		$60130
  int acc11c_2;			// 0x0C4		$60131
  int acc11c_3;			// 0x0C8		$60132
  int acc11c_5;			// 0x0CC		$60133
  int acc11c_6;			// 0x0D0		$60134
  int front_dac;		// 0x0D4		$60135
  int back_dac;			// 0x0D8		$60136
  int scint_piezo;		// 0x0DC		$60137

  int dummy4;			// 0x0E0		$60138
  int dummy5;			// 0x0E4		$60139
  int dummy6;			// 0x0E8		$6013A
  int dummy7;			// 0x0EC		$6013B
  int dummy8;			// 0x0F0		$6013C
  int dummy9;			// 0x0F4		$6013D
  int dummyA;			// 0x0F8		$6013E
  int dummyB;			// 0x0FC		$6013F

  int fs_is_open;		// 0x100		$60140
  int phiscan;			// 0x104		$60141
  int fs_has_opened;		// 0x108		$60142
  int fs_has_opened_globally;	// 0x10C		$60143
  int number_passes;		// 0x110		$60144

  int moving_flags;		// 0x114		$60145

} md2_status_t;

static md2_status_t md2_status;		//!< Buffer for MD2 Status
pthread_mutex_t md2_status_mutex;	//!< Synchronize reading/writting status buffer


typedef struct lspmac_ascii_buffers_struct {
  //                               here		DPRAM		PMAC
  uint16_t command_buf;		// 0x000	$0E9C		$0603A7
  uint16_t command_buf_cc;	// 0x002	$0E9E		
  char command_str[160];	// 0x004	$0EA0		$0603A8
  uint16_t response_buf;	// 0x0A4	$0F40		$0603D0
  uint16_t response_n;		// 0x0A6	$0F42
  char response_str[256];	// 0x0A8	$0F44		$0603D1
				// 0x1A8	$1044		$060411
} lspmac_ascii_buffers_t;
static lspmac_ascii_buffers_t lspmac_ascii_buffers;
pthread_mutex_t lspmac_ascii_buffers_mutex;

#define LSPMAC_DPASCII_QUEUE_LENGTH 1024
typedef struct lspmac_dpascii_queue_struct {
  char *event;			// pointer to location that wants the cmd_queue pointer
  char pl[160];			// Our payload
} lspmac_dpascii_queue_t;

static lspmac_dpascii_queue_t lspmac_dpascii_queue[LSPMAC_DPASCII_QUEUE_LENGTH];
static uint32_t lspmac_dpascii_on  = 0;
static uint32_t lspmac_dpascii_off = 0;

typedef struct lspmac_combined_move_struct {
  int    Delta;			// change from curent position in counts
  int    moveme;		// flag: non-zero means move this motor
  int    coord_num;		// Our coordinate system
  int    axis;			// The axes to move
} lspmac_combined_move_t;


/** Look up table support for motor positions (think x=zoom, y=light intensity)
