//
// pgpmac.c
//
// Some pmac defines, typedefs, functions suggested by Delta Tau
// Accessory 54E User Manual, October 23, 2003 (C) 2003 by Delta Tau Data
// Systems, Inc.  All rights reserved.
//
//
// Original work Copyright (C) 2012 by Keith Brister, Northwestern University, All rights reserved.
//
//
// TODO's:
//	This code is in desperate need of refactoring
//		consider 4 support modules for pmac, pg, ncurses, and epics
//		leaving main with just the event loop.
//
//	Epics support could come by adapting the "e.c" code to work here directly
//	or could come by making use of the existing kv pair mechanism already in place
//	or, as is most likely, a combination of the two.
//
//	Ncurses support could include input lines for SQL queries and direct commands
//	for supporting homing etc.  Perhaps the F keys could change modes or use of
//	special mode changing text commands.  Output is not asynchronous.  Although this is
//	unlikely to cause a problem I'd hate to have the program hang because terminal
//	output is hung up.
//
//	Currently the effort has been to make no changes to the PMAC motion programs or PLC/PLCC
//	programs to maintian 100% compatability with the MD2 VB code.
//	However, it seems that these contain a considerable amount of garbage code left over from
//	earier developments and false starts.  For example, unit conversions should be done at the PMAC level
//	instead of at a higher level and better use of DPRAM to transfer status information.
//

#include <math.h>

/*
  This is a state machine (surprise!)
  Lacking is support for writingbuffer, control writing and reading, as well as double buffered memory
  It looks like several different methods of managing PMAC communications are possible.  Here is set up a queue
  of outgoing commands and deal completely with the result before sending the next.  A full handshake of acknowledgements
  and "readready" is expected.

  State		Description

 -1		Reset the connection
  0		Detached: need to connect to tcp port
  1		Idle (waiting for a command to send to the pmac)
  2		Send command
  3		Waiting for command acknowledgement (no further response expected)
  4		Waiting for control character acknowledgement (further response expected)
  5		Waiting for command acknowledgement (further response expected)
  6		Waiting for get memory response
  7		Send controlresponse
  8		Send readready
  9		Waiting for acknowledgement of "readready"
 10		Send readbuffer
 11		Waiting for control response
 12		Waiting for readbuffer response
*/

#define LS_PMAC_STATE_RESET	-1
#define LS_PMAC_STATE_DETACHED  0
#define LS_PMAC_STATE_IDLE	1
#define LS_PMAC_STATE_SC	2
#define LS_PMAC_STATE_WACK_NFR	3
#define LS_PMAC_STATE_WACK_CC	4
#define LS_PMAC_STATE_WACK	5
#define LS_PMAC_STATE_GMR	6
#define LS_PMAC_STATE_CR	7
#define LS_PMAC_STATE_RR	8
#define LS_PMAC_STATE_WACK_RR	9
#define LS_PMAC_STATE_GB       10
#define LS_PMAC_STATE_WCR      11
#define LS_PMAC_STATE_WGB      12
static int ls_pmac_state = LS_PMAC_STATE_DETACHED;

/*
  Database state machine

State		Description

 -4		Initiate connection
 -3		Poll until connection initialization is complete
 -2		Initiate reset
 -1		Poll until connection reset is complete
  1		Idle (wait for a notify from the server)
  2		Send a query to the server
  3		Continue flushing a command to the server
  4		Waiting for a reply
  5		Continue waiting for a reply

*/

#define LS_PG_STATE_INIT	-4
#define LS_PG_STATE_INIT_POLL	-3
#define LS_PG_STATE_RESET	-2
#define LS_PG_STATE_RESET_POLL	-1
#define LS_PG_STATE_IDLE	1
#define LS_PG_STATE_SEND	2
#define LS_PG_STATE_SEND_FLUSH	3
#define LS_PG_STATE_RECV	4

static int ls_pg_state = LS_PG_STATE_INIT;



typedef unsigned char BYTE;
typedef unsigned short WORD;



//
// Stylistically this is a define.  Really, though, this value will never change.
//
#define PMACPORT 1025

//
// this size does not include the data
//
#define pmac_cmd_size 8

#define VR_UPLOAD		0xc0
#define VR_DOWNLOAD		0x40

#define VR_PMAC_SENDLINE	0xb0
#define VR_PMAC_GETLINE		0xb1
#define VR_PMAC_FLUSH		0xb3
#define VR_PMAC_GETMEM		0xb4
#define VR_PMAC_SETMEM		0xb5
#define VR_PMAC_SENDCTRLCHAR	0xb6
#define VR_PMAC_SETBIT		0xba
#define VR_PMAC_SETBITS		0xbb
#define VR_PMAC_PORT		0xbe
#define VR_PMAC_GETRESPONSE	0xbf
#define VR_PMAC_READREADY	0xc2
#define VR_CTRL_RESPONSE	0xc4
#define VR_PMAC_GETBUFFER	0xc5
#define VR_PMAC_WRITEBUFFER	0xc6
#define VR_PMAC_WRITEERROR	0xc7
#define VR_FWDOWNLOAD		0xcb
#define VR_IPADDRESS		0xe0


typedef struct lsDisplayStruct {
  int raw_position;		// raw position read from dpram
  int dpram_position_offset;	// offset of our position in the md2_status buffer ready by getmem
  int motor_num;		// pmac motor number
  char *units;			// string to use as the units
  char *format;			// printf format
  double u2c;			// conversion from counts to units
  WINDOW *win;			// our ncurses window
} ls_display_t;
static ls_display_t ls_displays[32];
static ls_ndisplays = 0;
static WINDOW *term_output;		// place to print stuff out
static WINDOW *term_input;		// place to put the cursor

#define LS_DISPLAY_WINDOW_HEIGHT 6
#define LS_DISPLAY_WINDOW_WIDTH  16

typedef struct tagEthernetCmd {
  BYTE RequestType;
  BYTE Request;
  WORD wValue;
  WORD wIndex;
  WORD wLength;
  BYTE bData[1492];
} pmac_cmd_t;

typedef struct pmacCmdQueueStruct {
  pmac_cmd_t pcmd;				// the pmac command to send
  int no_reply;					// 1 = no reply is expected, 0 = expect a reply
  int motor_group;				// group of 8 motors that status has been requested (0-3 for motors 1-8, 9-16, 17-24, and 25-32), -1 means status not yet requested
  unsigned char rbuff[1400];			// buffer for the returned bytes
  void (*onResponse)(struct pmacCmdQueueStruct *,int, unsigned char *);	// function to call when response is received.  args are (int fd, nreturned, buffer)
} pmac_cmd_queue_t;

typedef struct pmacMotorStruct {
  int status;			// 24 bits of status
  double p;			// position
  double v;			// velocity
  double f;			// following error
} pmac_motor_t;


#define LS_PG_QUERY_STRING_LENGTH 1024
typedef struct lspgQueryQueueStruct {
  char qs[LS_PG_QUERY_STRING_LENGTH];				// our queries should all be pretty short as we'll just be calling functions: fixed length here simplifies memory management
  void (*onResponse)( struct lspgQueryQueueStruct *qq, PGresult *pgr);		//
} lspg_query_queue_t;

#define LS_PG_QUERY_QUEUE_LENGTH 16318
static lspg_query_queue_t lspg_query_queue[LS_PG_QUERY_QUEUE_LENGTH];
static unsigned int lspg_query_queue_on    = 0;
static unsigned int lspg_query_queue_off   = 0;
static unsigned int lspg_query_queue_reply = 0;

//
// globals
//
static struct pollfd pmacfda;			// pollfd object for the pmac
static struct pollfd pgfda;			// pollfd object for the database connection
static struct pollfd stdinfda;			// Handle input from the keyboard
static int chatty=0;				// say what is going on
static int linesReceived=0;			// current number of lines received
static pmac_motor_t motors[32];			// current status of our motors
static unsigned char dbmem[64*1024];		// double buffered memory
static int dbmemIn = 0;				// next location
static PGconn *q = NULL;
static PostgresPollingStatusType lspg_connectPoll_response;
static PostgresPollingStatusType lspg_resetPoll_response;

void PmacSockSendline( char *s);

//
// minimum time between commands to the pmac
//
#define PMAC_MIN_CMD_TIME 20000.0
static struct timeval pmac_time_sent, now;	// used to ensure we do not send commands to the pmac too often.  Only needed for non-DB commands.

#define PMAC_CMD_QUEUE_LENGTH 2048
static pmac_cmd_t rr_cmd, gb_cmd, cr_cmd;		// commands to send out "readready", "getbuffer", controlresponse (initialized in main)
static pmac_cmd_queue_t ethCmdQueue[PMAC_CMD_QUEUE_LENGTH];
static unsigned int ethCmdOn    = 0;
static unsigned int ethCmdOff   = 0;
static unsigned int ethCmdReply = 0;

static char *pmac_error_strs[] = {
  "ERR000: Unknown error",
  "ERR001: Command not allowed during program execution",
  "ERR002: Password error",
  "ERR003: Data error or unrecognized command",
  "ERR004: Illegal character",
  "ERR005: Command not allowed unless buffer is open",
  "ERR006: No room in buffer for command",
  "ERR007: Buffer already in use",
  "ERR008: MACRO auziliary communication error",
  "ERR009: Program structure error (e.g. ENDIF without IF)",
  "ERR010: Both overtravel limits set for a motor in the C.S.",
  "ERR011: Previous move not completed",
  "ERR012: A motor in the coordinate system is open-loop",
  "ERR013: A motor in the coordinate system is not activated",
  "ERR014: No motors in the coordinate system",
  "ERR015: Not pointer to valid program buffer",
  "ERR016: Running improperly structure program (e.g. missing ENDWHILE)",
  "ERR017: Trying to resume after H or Q with motors out of stopped position",
  "ERR018: Attempt to perform phase reference during move, move during phase reference, or enabling with phase clock error",
  "ERR019: Illegal position-chage command while moves stored in CCBUFFER"
};

/*
**
** MD2 Motors and Coordinate Systems
**

  CS       Motor

  1		1	X = Omega

  2		17	X = Center X
		18	Y = Center Y

  3		2	X = Alignment X
		3	Y = Alignment Y
		4	Z = Alignment Z

  --            5       Analyzer

  4		6	X = Zoom

  5		7	Y = Aperture Y
		8	Z = Aperture Z
		9	U = Capillary Y
	       10	V = Capillary Z
	       11	W = Scintillator Z

  6			(None)

  7	       19	X = Kappa
	       20	Y = Phi

*/

/*
**
** MD2 Motion Programs
**

before calling, set
   M4XX = 1:  flag to indicate we are running program XX
   P variables as arguments

Program		Description
  1		home omega
  2		home alignment table X
  3		home alignment table Y
  4		home alignment table Z
  6		home camera zoom
  7		home aperture Y
  8		home aperture Z
  9		home capillary Y
 10		home capillary Z
 11		home scintillator Z
 17		home center X
 18		home center Y
 19		home kappa
 20		home phi (Home position is not defined for phi ...)
 25		kappa stress test

 26		Combined Incremental move of X and Y in selected coordinate system
			(Does not reset M426)
			P170  = X increment
			P171  = Y increment

 31		scan omega
			P170  = Start
			P171  = End
			P173  = Velocity (float)
			P174  = Sample Rate (I5049)
			P175  = Acceleration time
			P176  = Gathering source
			P177  = Number of passes
			P178  = Shutter rising distance (units of omega motion)
			P179  = Shutter falling distance (units of omega motion)
			P180  = Exposure Time

 34		Organ Scan
			P169  = Motor Number
			P170  = Start Position
			P171  = End Position
			P172  = Step Size
			P173  = Motor Speed

 35		Organ Homing

 37		Organ Move   (microdiff_hard.ini says we don't use this anymore)
			P169  = Capillary Z
			P170  = Scintillator Z
			P171  = Aperture Z

 50		Combined Incremental move of X and Y
			P170  = X increment
			P171  = Y increment

 52		X oscillation (while M320 == 1)
			(Does not reset M452)
		    
 53		Center X and Y Synchronized homing

 54		Combined X, Y, Z absolute move
			P170  = X
			P171  = Y
			P172  = Z


*/


//
// DPRAM is from $60000 to ????
// 
// We can quickly read 1400 bytes = 350 32-bit registers
// so reading $60000 to 60015D is not too expensive
//
// Gather data starts at $600450 (per turbo pmac user manual)
//
// MD2 seems to use $60060 to 
//
typedef  struct md2StatusStruct {
  //
  // Pmac stores data in 24 bit or 48 bit words
  //
  // The DP: addresses point to the low 16 bits of the 24 bit X and Y registers
  //
  //  PMAC       Our dp ram offset
  //
  // Y:$060000      0x0000
  // X:$060000      0x0002
  // Y:$060001      0x0004
  // X:$060001      0x0006
  // And so forth
  //
  //
  int omegaHome;		// 0x00           $60060 omega encoder reading at home position
  int dummy1[31];		//
  int omega;			// 0x080           $60080
  int tablex;			// 0x084           $60081
  int tabley;			// 0x088           $60082
  int tablez;			// 0x08C           $60083
  int analyzer;			// 0x090           $60084
  int zoom;			// 0x094           $60085
  int aperturey;		// 0x098           $60086
  int aperturez;		// 0x09C           $60087
  int capy;			// 0x0A0           $60088
  int capz;			// 0x0A4           $60089
  int scinz;			// 0x0A8           $6008A
  int dummy2[5];		// 0x0AC - 0x0BC   $6008B - $6008F
  int centerx;			// 0x0C0           $60090
  int centery;			// 0x0C4           $60091
  int kappa;			// 0x0C8           $60092
  int phi;			// 0x0CC           $60093
  int dummy3[4];		// 0x0D0 - 0x0DC   $60094 - $60097
  int dummy4[28];		// 0x0E0 - 0x14C   $60098 - $600B3
  int freq;			// 0x150           $600B4  (commented out in Pmac_MD2.pmc so it's not being set)
  int dummy5[11];		// 0x154 - 0x17C   $600B5 - $600BF
  int globalstat1;		// 0x180           $600C0
  int globalstat2;		// 0x184           $600C1
  int globalstat3;		// 0x188           $600C2

} md2_status_t;

static md2_status_t md2_status;


// swap double to put in into network byte order                                                                                                                           
// from http://www.dmh2000.com/cpp/dswap.shtml                                                                                                                             
//                                                                                                                                                                         
unsigned long long  swapd(double d) {
  unsigned long long a;
  unsigned char *dst = (unsigned char *)&a;
  unsigned char *src = (unsigned char *)&d;

  dst[0] = src[7];
  dst[1] = src[6];
  dst[2] = src[5];
  dst[3] = src[4];
  dst[4] = src[3];
  dst[5] = src[2];
  dst[6] = src[1];
  dst[7] = src[0];

  return a;
}

double unswapd( long long a) {
  double d;
